Graph500.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Graph 500 Benchmark 1 ("Search")</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-10-05 10:35:40 EDT"/>
<meta name="author" content="Graph 500 Steering Committee"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">Graph 500 Benchmark 1 ("Search")</h1>

<p>Contributors: David A. Bader (Georgia Institute of Technology),
Jonathan Berry (Sandia National Laboratories), Simon Kahan (Pacific
Northwest National Laboratory and University of Washington), Richard
Murphy (Sandia National Laboratories), E. Jason Riedy (Georgia
Institute of Technology), and Jeremiah Willcock (Indiana University).
</p>
<p>
Version History:
</p><dl>
<dt>V0.1</dt><dd>
Draft, created 28 July 2010
</dd>
<dt>V0.2</dt><dd>
Draft, created 29 September 2010
</dd>
<dt>V0.3</dt><dd>
Draft, created 30 September 2010
</dd>
<dt>V1.0</dt><dd>
Created 1 October 2010
</dd>
<dt>V1.1</dt><dd>
Created 3 October 2010

</dd>
</dl>

<p>Version 0.1 of this document was part of the Graph 500 community
benchmark effort, led by Richard Murphy (Sandia National
Laboratories).  The intent is that there will be at least three
variants of implementations, on shared memory and threaded systems, on
distributed memory clusters, and on external memory map-reduce
clouds. This specification is for the first of potentially several
benchmark problems.
</p>
<p>
References: "Introducing the Graph 500," Richard C. Murphy, Kyle
B. Wheeler, Brian W. Barrett, James A. Ang, Cray User’s Group (CUG),
May 5, 2010.
</p>
<p>
"DFS: A Simple to Write Yet Difficult to Execute Benchmark," Richard
C. Murphy, Jonathan Berry, William McLendon, Bruce Hendrickson,
Douglas Gregor, Andrew Lumsdaine, IEEE International Symposium on
Workload Characterizations 2006 (IISWC06), San Jose, CA, 25-27 October
2006.
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Brief Description of the Graph 500 Benchmark </a>
<ul>
<li><a href="#sec-1_1">1.1 References </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Overall benchmark </a></li>
<li><a href="#sec-3">3 Generating the edge list </a>
<ul>
<li><a href="#sec-3_1">3.1 Brief Description </a></li>
<li><a href="#sec-3_2">3.2 Detailed Text Description </a></li>
<li><a href="#sec-3_3">3.3 Sample high-level implementation of the Kronecker generator </a></li>
<li><a href="#sec-3_4">3.4 Parameter settings </a></li>
<li><a href="#sec-3_5">3.5 References </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Kernel 1 – Graph Construction </a>
<ul>
<li><a href="#sec-4_1">4.1 Description </a></li>
<li><a href="#sec-4_2">4.2 References </a></li>
</ul>
</li>
<li><a href="#sec-5">5 Sampling 64 search keys </a></li>
<li><a href="#sec-6">6 Kernel 2 – Breadth-First Search </a>
<ul>
<li><a href="#sec-6_1">6.1 Description </a></li>
<li><a href="#sec-6_2">6.2 Kernel 2 Output </a></li>
</ul>
</li>
<li><a href="#sec-7">7 Validation </a></li>
<li><a href="#sec-8">8 Computing and outputting performance information </a>
<ul>
<li><a href="#sec-8_1">8.1 Timing </a></li>
<li><a href="#sec-8_2">8.2 Performance Metric (TEPS) </a></li>
<li><a href="#sec-8_3">8.3 Output </a></li>
<li><a href="#sec-8_4">8.4 References </a></li>
</ul>
</li>
<li><a href="#sec-9">9 Sample driver </a></li>
<li><a href="#sec-10">10 Evaluation Criteria </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Brief Description of the Graph 500 Benchmark </h2>
<div class="outline-text-2" id="text-1">


<p>
Data-intensive supercomputer applications are an increasingly
important workload, but are ill-suited for platforms designed for 3D
physics simulations. Application performance cannot be improved
without a meaningful benchmark. Graphs are a core part of most
analytics workloads. Backed by a steering committee of 30
international HPC experts from academia, industry, and national
laboratories, this specification establishes a large-scale benchmark
for these applications. It will offer a forum for the community and
provide a rallying point for data-intensive supercomputing
problems. This is the first serious approach to augment the Top 500
with data-intensive applications.
</p>
<p>
The intent of this benchmark problem ("Search") is to develop a
compact application that has multiple analysis techniques (multiple
kernels) accessing a single data structure representing a weighted,
undirected graph. In addition to a kernel to construct the graph from
the input tuple list, there is one additional computational
kernel to operate on the graph.
</p>
<p>
This benchmark includes a scalable data generator which produces edge
tuples containing the start vertex and end vertex for each
edge. The first kernel constructs an <i>undirected</i> graph in a format
usable by all subsequent kernels. No subsequent modifications are
permitted to benefit specific kernels. The second kernel performs a
breadth-first search of the graph. Both kernels are timed.
</p>
<p>
There are five problem classes defined by their input size:
</p><dl>
<dt>toy</dt><dd>
17GB or around 10<sup>10</sup> bytes, which we also call level 10,
</dd>
<dt>mini</dt><dd>
140GB (10<sup>11</sup> bytes, level 11),
</dd>
<dt>small</dt><dd>
1TB (10<sup>12</sup> bytes, level 12),
</dd>
<dt>medium</dt><dd>
17TB (10<sup>13</sup> bytes, level 13),
</dd>
<dt>large</dt><dd>
140TB (10<sup>14</sup> bytes, level 14), and
</dd>
<dt>huge</dt><dd>
1.1PB (10<sup>15</sup> bytes, level 15).

</dd>
</dl>

<p>Table <a href="#tbl:classes">classes</a> provides the parameters used by the graph
generator specified below.
</p>

</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> References </h3>
<div class="outline-text-3" id="text-1_1">


<p>
D.A. Bader, J. Feo, J. Gilbert, J. Kepner, D. Koester, E. Loh,
K. Madduri, W. Mann, Theresa Meuse, HPCS Scalable Synthetic Compact
Applications #2 Graph Analysis (SSCA#2 v2.2 Specification), 5
September 2007.
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Overall benchmark </h2>
<div class="outline-text-2" id="text-2">


<p>
The benchmark performs the following steps:
</p>
<ol>
<li>
Generate the edge list.
</li>
<li>
Construct a graph from the edge list (<b>timed</b>, kernel 1).
</li>
<li>
Randomly sample 64 unique search keys with degree at least one,
not counting self-loops.
</li>
<li>
For each search key:
<ol>
<li>
Compute the parent array (<b>timed</b>, kernel 2).
</li>
<li>
Validate that the parent array is a correct BFS search tree
for the given search tree.
</li>
</ol>
</li>
<li>
Compute and output performance information.

</li>
</ol>

<p>Only the sections marked as <b>timed</b> are included in the performance
information.  Note that all uses of "random" permit pseudorandom
number generation.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Generating the edge list </h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> Brief Description </h3>
<div class="outline-text-3" id="text-3_1">


<p>
The scalable data generator will construct a list of edge tuples
containing vertex identifiers. Each edge is undirected with its
endpoints given in the tuple as StartVertex and EndVertex. 
</p>
<p>
The intent of the first kernel below is to convert a list with no
locality into a more optimized form.  The generated list of input
tuples must not exhibit any locality that can be exploited by the
computational kernels.  Thus, the vertex numbers must be randomized
and a random ordering of tuples must be presented to kernel 1.
The data generator may be parallelized, but the vertex names
must be globally consistent and care must be taken to minimize effects
of data locality at the processor level.
</p>
</div>

</div>
