Graph500.org
** Detailed Text Description

The edge tuples will have the form <StartVertex, EndVertex> where
StartVertex is one endpoint vertex label and EndVertex is the
other endpoint vertex label.  The space of labels is the set of integers
beginning with *zero* up to but not including the number of vertices N
(defined below).  The kernels are not provided the size N explicitly
but must discover it.

The input values required to describe the graph are:

 - SCALE :: The logarithm base two of the number of vertices.

 - edgefactor :: The ratio of the graph's edge count to its vertex count (i.e.,
                 half the average degree of a vertex in the graph).

These inputs determine the graph's size:

 - N :: the total number of vertices, 2^SCALE. An implementation may
   use any set of N distinct integers to number the vertices, but at
   least 48 bits must be allocated per vertex number. Other parameters
   may be assumed to fit within the natural word of the machine. N is
   derived from the problem’s scaling parameter.

 - M :: the number of edges. M = edgefactor * N.

The graph generator is a Kronecker generator similar to the Recursive
MATrix (R-MAT) scale-free graph generation algorithm [Chakrabarti, et
al., 2004]. For ease of discussion, the description of this R-MAT
generator uses an adjacency matrix data structure; however,
implementations may use any alternate approach that outputs the
equivalent list of edge tuples. This model recursively sub-divides the
adjacency matrix of the graph into four equal-sized partitions and
distributes edges within these partitions with unequal
probabilities. Initially, the adjacency matrix is empty, and edges are
added one at a time. Each edge chooses one of the four partitions with
probabilities A, B, C, and D, respectively.  These probabilities, the
initiator parameters, are provided in Table \ref{tbl:initiator}.

#+CAPTION: Initiator parameters for the Kronecker graph generator
#+LABEL:   tbl:initiator
| A = 0.57 | B = 0.19             |
| C = 0.19 | D = 1-(A+B+C) = 0.05 |

The next section details a high-level implementation for this
generator.  High-performance, parallel implementations are included in
the reference implementation.

The graph generator creates a small number of multiple edges between
two vertices as well as self-loops. Multiple edges, self-loops, and
isolated vertices may be ignored in the subsequent kernels but must
be included in the edge list provided to the first kernel. The
algorithm also generates the data tuples with high degrees of
locality. Thus, as a final step, vertex numbers must be randomly
permuted, and then the edge tuples randomly shuffled.

It is permissible to run the data generator in parallel. In this case,
it is necessary to ensure that the vertices are named globally, and
that the generated data does not possess any locality, either in local memory
or globally across processors.

The scalable data generator should be run before starting kernel 1, storing its
results to either RAM or disk.
If stored to disk, the data may be retrieved before
starting kernel 1. The data generator and retrieval operations need not be
timed.

** Sample high-level implementation of the Kronecker generator

The GNU Octave routine in Algorithm \ref{alg:generator} is an
attractive implementation in that it is embarrassingly parallel and
does not require the explicit formation of the adjacency matrix.

#+CAPTION: High-level generator code
#+LABEL: alg:generator
#+BEGIN_SRC Octave
function ij = kronecker_generator (SCALE, edgefactor)
%% Generate an edgelist according to the Graph500
%% parameters.  In this sample, the edge list is
%% returned in an array with two rows, where StartVertex
%% is first row and EndVertex is the second.  The vertex
%% labels start at zero.
%%
%% Example, creating a sparse matrix for viewing:
%%   ij = kronecker_generator (10, 16);
%%   G = sparse (ij(1,:)+1, ij(2,:)+1, ones (1, size (ij, 2)));
%%   spy (G);
%% The spy plot should appear fairly dense. Any locality
%% is removed by the final permutations.

  %% Set number of vertices.
  N = 2^SCALE;

  %% Set number of edges.
  M = edgefactor * N;

  %% Set initiator probabilities.
  [A, B, C] = deal (0.57, 0.19, 0.19);

  %% Create index arrays.
  ij = ones (2, M);
  %% Loop over each order of bit.
  ab = A + B;
  c_norm = C/(1 - (A + B));
  a_norm = A/(A + B);

  for ib = 1:SCALE,
    %% Compare with probabilities and set bits of indices.
    ii_bit = rand (1, M) > ab;
    jj_bit = rand (1, M) > ( c_norm * ii_bit + a_norm * not (ii_bit) );
    ij = ij + 2^(ib-1) * [ii_bit; jj_bit];
  end

  %% Permute vertex labels
  p = randperm (N);
  ij = p(ij);

  %% Permute the edge list
  p = randperm (M);
  ij = ij(:, p);

  %% Adjust to zero-based labels.
  ij = ij - 1;
#+END_SRC

** Parameter settings

The input parameter settings for each class are given in Table \ref{tbl:classes}.

#+CAPTION: Problem class definitions and required storage for the edge list assuming 64-bit integers.
#+LABEL: tbl:classes
| Problem class     | SCALE | edge factor | Approx. storage size in TB |
|-------------------+-------+-------------+----------------------------|
| Toy (level 10)    |    26 |          16 |                     0.0172 |
| Mini (level 11)   |    29 |          16 |                     0.1374 |
| Small (level 12)  |    32 |          16 |                     1.0995 |
| Medium (level 13) |    36 |          16 |                    17.5922 |
| Large (level 14)  |    39 |          16 |                   140.7375 |
| Huge (level 15)   |    42 |          16 |                  1125.8999 |
#+TBLFM: $4=2^$2*$3*2*8/1e12;%.4f

** References

D. Chakrabarti, Y. Zhan, and C. Faloutsos, R-MAT: A recursive model
for graph mining, SIAM Data Mining 2004.

Section 17.6, Algorithms in C (third edition). Part 5 Graph
Algorithms, Robert Sedgewick (Programs 17.7 and 17.8)

P. Sanders, Random Permutations on Distributed, External and
Hierarchical Memory, Information Processing Letters 67 (1988) pp
305-309.

* Kernel 1 – Graph Construction

