Graph500.html

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> Detailed Text Description </h3>
<div class="outline-text-3" id="text-3_2">


<p>
The edge tuples will have the form &lt;StartVertex, EndVertex&gt; where
StartVertex is one endpoint vertex label and EndVertex is the
other endpoint vertex label.  The space of labels is the set of integers
beginning with <b>zero</b> up to but not including the number of vertices N
(defined below).  The kernels are not provided the size N explicitly
but must discover it.
</p>
<p>
The input values required to describe the graph are:
</p>
<dl>
<dt>SCALE</dt><dd>
The logarithm base two of the number of vertices.

</dd>
<dt>edgefactor</dt><dd>
The ratio of the graph's edge count to its vertex count (i.e.,
half the average degree of a vertex in the graph).

</dd>
</dl>

<p>These inputs determine the graph's size:
</p>
<dl>
<dt>N</dt><dd>
the total number of vertices, 2<sup>SCALE</sup>. An implementation may
use any set of N distinct integers to number the vertices, but at
least 48 bits must be allocated per vertex number. Other parameters
may be assumed to fit within the natural word of the machine. N is
derived from the problem’s scaling parameter.

</dd>
<dt>M</dt><dd>
the number of edges. M = edgefactor * N.

</dd>
</dl>

<p>The graph generator is a Kronecker generator similar to the Recursive
MATrix (R-MAT) scale-free graph generation algorithm [Chakrabarti, et
al., 2004]. For ease of discussion, the description of this R-MAT
generator uses an adjacency matrix data structure; however,
implementations may use any alternate approach that outputs the
equivalent list of edge tuples. This model recursively sub-divides the
adjacency matrix of the graph into four equal-sized partitions and
distributes edges within these partitions with unequal
probabilities. Initially, the adjacency matrix is empty, and edges are
added one at a time. Each edge chooses one of the four partitions with
probabilities A, B, C, and D, respectively.  These probabilities, the
initiator parameters, are provided in Table <a href="#tbl:initiator">initiator</a>.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<a name="tbl:initiator" id="tbl:initiator"></a>
<caption>Initiator parameters for the Kronecker graph generator</caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>A = 0.57</td><td>B = 0.19</td></tr>
<tr><td>C = 0.19</td><td>D = 1-(A+B+C) = 0.05</td></tr>
</tbody>
</table>


<p>
The next section details a high-level implementation for this
generator.  High-performance, parallel implementations are included in
the reference implementation.
</p>
<p>
The graph generator creates a small number of multiple edges between
two vertices as well as self-loops. Multiple edges, self-loops, and
isolated vertices may be ignored in the subsequent kernels but must
be included in the edge list provided to the first kernel. The
algorithm also generates the data tuples with high degrees of
locality. Thus, as a final step, vertex numbers must be randomly
permuted, and then the edge tuples randomly shuffled.
</p>
<p>
It is permissible to run the data generator in parallel. In this case,
it is necessary to ensure that the vertices are named globally, and
that the generated data does not possess any locality, either in local memory
or globally across processors.
</p>
<p>
The scalable data generator should be run before starting kernel 1, storing its
results to either RAM or disk.
If stored to disk, the data may be retrieved before
starting kernel 1. The data generator and retrieval operations need not be
timed.
</p>
</div>

</div>

<div id="outline-container-3_3" class="outline-3">
<h3 id="sec-3_3"><span class="section-number-3">3.3</span> Sample high-level implementation of the Kronecker generator </h3>
<div class="outline-text-3" id="text-3_3">


<p>
The GNU Octave routine in Algorithm <a href="#alg:generator">generator</a> is an
attractive implementation in that it is embarrassingly parallel and
does not require the explicit formation of the adjacency matrix.
</p>



<pre class="src src-Octave">function ij = kronecker_generator (SCALE, edgefactor)
%% Generate an edgelist according to the Graph500
%% parameters.  In this sample, the edge list is
%% returned in an array with two rows, where StartVertex
%% is first row and EndVertex is the second.  The vertex
%% labels start at zero.
%%
%% Example, creating a sparse matrix for viewing:
%%   ij = kronecker_generator (10, 16);
%%   G = sparse (ij(1,:)+1, ij(2,:)+1, ones (1, size (ij, 2)));
%%   spy (G);
%% The spy plot should appear fairly dense. Any locality
%% is removed by the final permutations.

  %% Set number of vertices.
  N = 2^SCALE;

  %% Set number of edges.
  M = edgefactor * N;

  %% Set initiator probabilities.
  [A, B, C] = deal (0.57, 0.19, 0.19);

  %% Create index arrays.
  ij = ones (2, M);
  %% Loop over each order of bit.
  ab = A + B;
  c_norm = C/(1 - (A + B));
  a_norm = A/(A + B);

  for ib = 1:SCALE,
    %% Compare with probabilities and set bits of indices.
    ii_bit = rand (1, M) &gt; ab;
    jj_bit = rand (1, M) &gt; ( c_norm * ii_bit + a_norm * not (ii_bit) );
    ij = ij + 2^(ib-1) * [ii_bit; jj_bit];
  end

  %% Permute vertex labels
  p = randperm (N);
  ij = p(ij);

  %% Permute the edge list
  p = randperm (M);
  ij = ij(:, p);

  %% Adjust to zero-based labels.
  ij = ij - 1;
</pre>



</div>

</div>

<div id="outline-container-3_4" class="outline-3">
<h3 id="sec-3_4"><span class="section-number-3">3.4</span> Parameter settings </h3>
<div class="outline-text-3" id="text-3_4">


<p>
The input parameter settings for each class are given in Table <a href="#tbl:classes">classes</a>.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<a name="tbl:classes" id="tbl:classes"></a>
<caption>High-level generator code Problem class definitions and required storage for the edge list assuming 64-bit integers.</caption>
<colgroup><col align="left" /><col align="right" /><col align="right" /><col align="right" />
</colgroup>
<thead>
<tr><th scope="col">Problem class</th><th scope="col">SCALE</th><th scope="col">edge factor</th><th scope="col">Approx. storage size in TB</th></tr>
</thead>
<tbody>
<tr><td>Toy (level 10)</td><td>26</td><td>16</td><td>0.0172</td></tr>
<tr><td>Mini (level 11)</td><td>29</td><td>16</td><td>0.1374</td></tr>
<tr><td>Small (level 12)</td><td>32</td><td>16</td><td>1.0995</td></tr>
<tr><td>Medium (level 13)</td><td>36</td><td>16</td><td>17.5922</td></tr>
<tr><td>Large (level 14)</td><td>39</td><td>16</td><td>140.7375</td></tr>
<tr><td>Huge (level 15)</td><td>42</td><td>16</td><td>1125.8999</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3_5" class="outline-3">
<h3 id="sec-3_5"><span class="section-number-3">3.5</span> References </h3>
<div class="outline-text-3" id="text-3_5">


<p>
D. Chakrabarti, Y. Zhan, and C. Faloutsos, R-MAT: A recursive model
for graph mining, SIAM Data Mining 2004.
</p>
<p>
Section 17.6, Algorithms in C (third edition). Part 5 Graph
Algorithms, Robert Sedgewick (Programs 17.7 and 17.8)
</p>
<p>
P. Sanders, Random Permutations on Distributed, External and
Hierarchical Memory, Information Processing Letters 67 (1988) pp
305-309.
</p>
</div>
</div>

</div>
