Graph500.html

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Validation </h2>
<div class="outline-text-2" id="text-7">


<p>
It is not intended that the results of full-scale runs of this
benchmark can be validated by exact comparison to a standard reference
result. At full scale, the data set is enormous, and its exact details
depend on the pseudo-random number generator and BFS algorithm used. Therefore,
the
validation of an implementation of the benchmark uses soft checking of
the results.
</p>
<p>
We emphasize that the intent of this benchmark is to exercise these
algorithms on the largest data sets that will fit on machines being
evaluated. However, for debugging purposes it may be desirable to run
on small data sets, and it may be desirable to verify parallel results
against serial results, or even against results from the executable
specification.
</p>
<p>
The executable specification verifies its results by comparing them
with results computed directly from the tuple list.
</p>
<p>
Kernel 2 validation: after each search, run (but do not time) a
function that ensures that the discovered breadth-first tree is
correct by ensuring that:
</p>
<ol>
<li>
the BFS tree is a tree and does not contain cycles,
</li>
<li>
each tree edge connects vertices whose BFS levels differ by
exactly one,
</li>
<li>
every edge in the input list has vertices with levels that differ
by at most one or that both are not in the BFS tree,
</li>
<li>
the BFS tree spans an entire connected component's vertices, and
</li>
<li>
a node and its parent are joined by an edge of the original graph.

</li>
</ol>

<p>Algorithm <a href="#alg:validate">validate</a> shows a sample validation routine.
</p>



<pre class="src src-Octave">function out = validate (parent, ij, search_key)
  out = 1;
  parent = parent + 1;
  search_key = search_key + 1;

  if parent (search_key) != search_key,
    out = 0;
    return;
  end

  ij = ij + 1;
  N = max (max (ij));
  slice = find (parent &gt; 0);

  level = zeros (size (parent));
  level (slice) = 1;
  P = parent (slice);
  mask = P != search_key;
  k = 0;
  while any (mask),
    level(slice(mask)) = level(slice(mask)) + 1;
    P = parent (P);
    mask = P != search_key;
    k = k + 1;
    if k &gt; N,
      %% There must be a cycle in the tree.
      out = -3;
      return;
    end
  end

  lij = level (ij);
  neither_in = lij(1,:) == 0 &amp; lij(2,:) == 0;
  both_in = lij(1,:) &gt; 0 &amp; lij(2,:) &gt; 0;
  if any (not (neither_in | both_in)),
    out = -4;
    return
  end
  respects_tree_level = abs (lij(1,:) - lij(2,:)) &lt;= 1;
  if any (not (neither_in | respects_tree_level)),
    out = -5;
    return
  end
</pre>



</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Computing and outputting performance information </h2>
<div class="outline-text-2" id="text-8">



</div>

<div id="outline-container-8_1" class="outline-3">
<h3 id="sec-8_1"><span class="section-number-3">8.1</span> Timing </h3>
<div class="outline-text-3" id="text-8_1">


<p>
Start the time for a search immediately prior to visiting the search
root.  Stop the time for that search when the output has been written
to memory.  Do not time any I/O outside of the search routine.  If
your algorithm relies on problem-specific data structures (by our
definition, these are informed by vertex degree), you must include the
setup time for such structures in <i>each search</i>. The spirit of the
benchmark is to gauge the performance of a single search.  We run many
searches in order to compute means and variances, not to amortize data
structure setup time.
</p>
</div>

</div>

<div id="outline-container-8_2" class="outline-3">
<h3 id="sec-8_2"><span class="section-number-3">8.2</span> Performance Metric (TEPS) </h3>
<div class="outline-text-3" id="text-8_2">


<p>
In order to compare the performance of Graph 500 "Search"
implementations across a variety of architectures, programming models,
and productivity languages and frameworks, we adopt a new performance
metric described in this section. In the spirit of well-known
computing rates floating-point operations per second (flops) measured
by the LINPACK benchmark and global updates per second (GUPs) measured
by the HPCC RandomAccess benchmark, we define a new rate called traversed
edges per second (TEPS). We measure TEPS through the benchmarking of
kernel 2 as follows. Let time<sub>K2</sub>(n) be the measured execution time for
kernel 2. Let m be the number of input edge tuples within the
component traversed by the search, counting any multiple edges and
self-loops. We define the normalized performance rate (number of edge
traversals per second) as:
</p>

<div style="text-align: center">
<p>TEPS(n) = m / time<sub>K2</sub>(n)
</p>
</div>

</div>

</div>
