Graph500.html

<div id="outline-container-8_3" class="outline-3">
<h3 id="sec-8_3"><span class="section-number-3">8.3</span> Output </h3>
<div class="outline-text-3" id="text-8_3">


<p>
The output must contain the following information:
</p><dl>
<dt>SCALE</dt><dd>
Graph generation parameter
</dd>
<dt>edgefactor</dt><dd>
Graph generation parameter
</dd>
<dt>NBFS</dt><dd>
Number of BFS searches run, 64 for non-trivial graphs
</dd>
<dt>construction_time</dt><dd>
The single kernel 1 time
</dd>
<dt>min_time, firstquartile_time, median_time, thirdquartile_time, max_time</dt><dd>
Quartiles for the kernel 2 times
</dd>
<dt>mean_time, stddev_time</dt><dd>
Mean and standard deviation of the kernel 2 times
</dd>
<dt>min_nedge, firstquartile_nedge, median_nedge, thirdquartile_nedge, max_nedge</dt><dd>
Quartiles for the number of
input edges visited by kernel 2, see TEPS section above.
</dd>
<dt>mean_nedge, stddev_nedge</dt><dd>
Mean and standard deviation of the number of
input edges visited by kernel 2, see TEPS section above.
</dd>
<dt>min_TEPS, firstquartile_TEPS, median_TEPS, thirdquartile_TEPS, max_TEPS</dt><dd>
Quartiles for the kernel 2 TEPS
</dd>
<dt>harmonic_mean_TEPS, harmonic_stddev_TEPS</dt><dd>
Mean and standard
deviation of the kernel 2 TEPS.  <b>Note</b>: Because TEPS is a
rate, the rates are compared using <b>harmonic</b> means.

</dd>
</dl>

<p>Additional fields are permitted.  Algorithm <a href="#alg:output">output</a> provides
a high-level sample.
</p>



<pre class="src src-Octave">function output (SCALE, edgefactor, NBFS, kernel_1_time, kernel_2_time, kernel_2_nedge)
  printf (<span style="color: #8b2252;">"SCALE: %d\n"</span>, SCALE);
  printf (<span style="color: #8b2252;">"edgefactor: %d\n"</span>, edgefactor);
  printf (<span style="color: #8b2252;">"NBFS: %d\n"</span>, NBFS);
  printf (<span style="color: #8b2252;">"construction_time: %20.17e\n"</span>, kernel_1_time);

  S = statistics (kernel_2_time);
  printf (<span style="color: #8b2252;">"min_time: %20.17e\n"</span>, S(1));
  printf (<span style="color: #8b2252;">"firstquartile_time: %20.17e\n"</span>, S(2));
  printf (<span style="color: #8b2252;">"median_time: %20.17e\n"</span>, S(3));
  printf (<span style="color: #8b2252;">"thirdquartile_time: %20.17e\n"</span>, S(4));
  printf (<span style="color: #8b2252;">"max_time: %20.17e\n"</span>, S(5));
  printf (<span style="color: #8b2252;">"mean_time: %20.17e\n"</span>, S(6));
  printf (<span style="color: #8b2252;">"stddev_time: %20.17e\n"</span>, S(7));

  S = statistics (kernel_2_nedge);
  printf (<span style="color: #8b2252;">"min_nedge: %20.17e\n"</span>, S(1));
  printf (<span style="color: #8b2252;">"firstquartile_nedge: %20.17e\n"</span>, S(2));
  printf (<span style="color: #8b2252;">"median_nedge: %20.17e\n"</span>, S(3));
  printf (<span style="color: #8b2252;">"thirdquartile_nedge: %20.17e\n"</span>, S(4));
  printf (<span style="color: #8b2252;">"max_nedge: %20.17e\n"</span>, S(5));
  printf (<span style="color: #8b2252;">"mean_nedge: %20.17e\n"</span>, S(6));
  printf (<span style="color: #8b2252;">"stddev_nedge: %20.17e\n"</span>, S(7));

  TEPS = kernel_2_nedge ./ kernel_2_time;
  N = length (TEPS);
  S = statistics (TEPS);
  S(6) = mean (TEPS, 'h');
  %% Harmonic standard deviation from:
  %% Nilan Norris, The Standard Errors of the Geometric and Harmonic
  %% Means and Their Application to Index Numbers, 1940.
  %% http://www.jstor.org/stable/2235723
  tmp = zeros (N, 1);
  tmp(TEPS &gt; 0) = 1./TEPS(TEPS &gt; 0);
  tmp = tmp - 1/S(6);
  S(7) = (sqrt (sum (tmp.^2)) / (N-1)) * S(6)^2;

  printf (<span style="color: #8b2252;">"min_TEPS: %20.17e\n"</span>, S(1));
  printf (<span style="color: #8b2252;">"firstquartile_TEPS: %20.17e\n"</span>, S(2));
  printf (<span style="color: #8b2252;">"median_TEPS: %20.17e\n"</span>, S(3));
  printf (<span style="color: #8b2252;">"thirdquartile_TEPS: %20.17e\n"</span>, S(4));
  printf (<span style="color: #8b2252;">"max_TEPS: %20.17e\n"</span>, S(5));
  printf (<span style="color: #8b2252;">"harmonic_mean_TEPS: %20.17e\n"</span>, S(6));
  printf (<span style="color: #8b2252;">"harmonic_stddev_TEPS: %20.17e\n"</span>, S(7));
</pre>



</div>

</div>

<div id="outline-container-8_4" class="outline-3">
<h3 id="sec-8_4"><span class="section-number-3">8.4</span> References </h3>
<div class="outline-text-3" id="text-8_4">


<p>
Nilan Norris, The Standard Errors of the Geometric and Harmonic Means
and Their Application to Index Numbers, The Annals of Mathematical
Statistics, vol. 11, num. 4, 1940.
<a href="http://www.jstor.org/stable/2235723">http://www.jstor.org/stable/2235723</a>
</p>
</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Sample driver </h2>
<div class="outline-text-2" id="text-9">


<p>
A high-level sample driver for the above routines is given in
Algorithm <a href="#alg:driver">driver</a>.
</p>



<pre class="src src-Octave">SCALE = 10;
edgefactor = 16;
NBFS = 64;

rand (<span style="color: #8b2252;">"seed"</span>, 103);

ij = kronecker_generator (SCALE, edgefactor);

tic;
G = kernel_1 (ij);
kernel_1_time = toc;

N = size (G, 1);
coldeg = full (spstats (G));
search_key = randperm (N);
search_key(coldeg(search_key) == 0) = [];
if length (search_key) &gt; NBFS,
  search_key = search_key(1:NBFS);
else
  NBFS = length (search_key);
end
search_key = search_key - 1;  

kernel_2_time = Inf * ones (NBFS, 1);
kernel_2_nedge = zeros (NBFS, 1);

indeg = histc (ij(:), 1:N); % For computing the number of edges

for k = 1:NBFS,
  tic;
  parent = kernel_2 (G, search_key(k));
  kernel_2_time(k) = toc;
  err = validate (parent, ij, search_key (k));
  if err &lt;= 0,
    error (sprintf (<span style="color: #8b2252;">"BFS %d from search key %d failed to validate: %d"</span>,
                    k, search_key(k), err));
  end
  kernel_2_nedge(k) = sum (indeg(parent &gt;= 0))/2; % Volume/2
end

output (SCALE, edgefactor, NBFS, kernel_1_time, kernel_2_time, kernel_2_nedge);
</pre>



</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Evaluation Criteria </h2>
<div class="outline-text-2" id="text-10">


<p>
In approximate order of importance, the goals of this benchmark are:
</p><ul>
<li>
Fair adherence to the intent of the benchmark specification
</li>
<li>
Maximum problem size for a given machine
</li>
<li>
Minimum execution time for a given problem size

</li>
</ul>

<p>Less important goals:
</p><ul>
<li>
Minimum code size (not including validation code)
</li>
<li>
Minimal development time
</li>
<li>
Maximal maintainability
</li>
<li>
Maximal extensibility
</li>
</ul>

</div>
</div>
<div id="postamble">
<p class="author"> Author: Graph 500 Steering Committee
</p>
<p class="date"> Date: 2010-10-05 10:35:40 EDT</p>
<p class="creator">HTML generated by org-mode 7.01trans in emacs 24</p>
</div>
</div>
</body>
</html>
